namespace TaskManager.Domain.Enums;
/// <summary>
/// اولویت‌های ممکن برای یک تسک در سیستم مدیریت وظایف.
/// این enum سه سطح اهمیت برای تسک‌ها را تعریف می‌کند:
/// - Low: اولویت پایین، معمولاً برای کارهای غیرضروری یا بلندمدت.
/// - Medium: اولویت متوسط، برای کارهای عادی و روتین.
/// - High: اولویت بالا، برای کارهای فوری و مهم.
/// </summary>
public enum TaskPriority
{
    /// <summary>
    /// کمترین سطح اولویت؛ مناسب برای کارهایی که عجله‌ای برای انجام آنها نیست.
    /// مقدار عددی: 1
    /// </summary>
    Low = 1,

    /// <summary>
    /// سطح متوسط اولویت؛ مناسب برای کارهای روزمره و استاندارد.
    /// مقدار عددی: 2
    /// </summary>
    Medium = 2,

    /// <summary>
    /// بالاترین سطح اولویت؛ مناسب برای کارهای فوری و حیاتی که باید سریع انجام شوند.
    /// مقدار عددی: 3
    /// </summary>
    High = 3
}